In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series(np.arange(3), index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [4]:
ser2 = Series([3,4,5,6], index=['a','b','c','d'])
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [5]:
ser1+ser2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [8]:
dFrame1 = DataFrame(np.arange(4).reshape((2,2)), columns=list('ab'), index=['NYC','LA'])
dFrame1

     a  b
NYC  0  1
LA   2  3

In [11]:
dFrame2 = DataFrame(np.arange(9).reshape((3,3)), columns=list('adc'), index=['NYC','SF','LA'])
dFrame2

     a  d  c
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [12]:
dFrame1 + dFrame2

       a   b   c   d
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [13]:
dFrame1.add(dFrame2, fill_value=0)

       a    b    c    d
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [14]:
dFrame2

     a  d  c
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [16]:
# 先頭行を取得
ser3 = dFrame2.ix[0]
ser3

a    0
d    1
c    2
Name: NYC, dtype: int64

In [17]:
dFrame2 - ser3

     a  d  c
NYC  0  0  0
SF   3  3  3
LA   6  6  6